# Homebrew Bundle for dotfiles
# Usage: brew bundle --file=Brewfile

# Shell and Terminal Environment
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "chezmoi"
cask "wezterm"

# Modern CLI Replacements and File Tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "yazi"
brew "trash-cli"
brew "less"

# Development Tools
brew "git"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "fnm"
brew "uv"
brew "jq"
brew "openssh"

# System Monitoring and Info
brew "btop"
brew "fastfetch"

# Media, Documents and Compression
brew "chafa"
brew "glow"
brew "imagemagick"
brew "libheif"
brew "exiftool"
brew "p7zip"
brew "unzip"

# Fonts
cask "font-noto-color-emoji"
cask "font-monaspice-nerd-font"
cask "font-juliamono"
cask "font-lxgw-wenkai"

# Package Managers and AI Assistant
tap "opencode-ai/tap"
brew "opencode-ai/tap/opencode"
